app/Http/Controllers/Api/LoggsController.php

insert into `log_clients` (`log_id`, `client_id`, `name`, `support_branch`, `country`, `updated_at`, `created_at`) values (1, '765', 'bfd', 'gfwdf', 'gegrew', '2025-02-19 13:32:33', '2025-02-19 13:32:33')
insert into `log_app_users` (`app_user_id`, `name`, `log_client_id`, `updated_at`, `created_at`) values ('543', 'gfds', 1, '2025-02-19 13:32:33', '2025-02-19 13:32:33')
insert into `log_apps` (`log_id`, `app_version`, `web_service_version`, `database_version`, `back_office_version`, `app_id`, `app_name`, `updated_at`, `created_at`) values (1, 'v5.2.0', 'v3.2.6', 'v1.3.1', 'v5.3.2', '5342', 'hgfdd', '2025-02-19 13:32:33', '2025-02-19 13:32:33')
insert into `log_devices` (`log_id`, `brand`, `model`, `ram`, `disk`, `os`, `os_version`, `updated_at`, `created_at`) values (1, 'samsung', 'a52', '6G', '64G', 'android', 'v9.5.1', '2025-02-19 13:32:33', '2025-02-19 13:32:33')
---
    public function store(LogStoreRequest $request)
    {
        // return $request->all();

        try {

            $log = Log::create([
                "headers" => json_encode($request->headers->all()),
                "message" => json_encode([$request->message]),
                "source_type" => $request->source_type
            ]);

            $logClient = LogClient::create([
                "log_id" => $log->id,
                "client_id" => $request->client['id'],
                "name" => $request->client['name'],
                "support_branch" => $request->client['support_branch'],
                "country" => $request->client['country'],
            ]);

            LogAppUser::create([
                "app_user_id" => $request->app_user['id'],
                "name" => $request->app_user['name'],
                "log_client_id" => $logClient->id
            ]);

            LogApp::create([
                "log_id" => $log->id,
                "app_version" => $request->app_version,
                "web_service_version" => $request->web_service_version,
                "database_version" => $request->database_version,
                "back_office_version" => $request->back_office_version,
                "app_id" => $request->app_id,
                "app_name" => $request->app_name
            ]);

            LogDevice::create([
                "log_id" => $log->id,
                "brand" => $request->brand,
                "model" => $request->model,
                "ram" => $request->ram,
                "disk" => $request->disk,
                "os" => $request->os,
                "os_version" => $request->os_version
            ]);